find-req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns="http://mrs.cmbi.ru.nl/mrsws/search">
 <SOAP-ENV:Body>
  <ns:Find>
   <ns:db>sprot</ns:db>
   <ns:queryterms>aap</ns:queryterms>
   <ns:queryterms>noot</ns:queryterms>
   <ns:algorithm>Dice</ns:algorithm>
   <ns:alltermsrequired>true</ns:alltermsrequired>
   <ns:booleanfilter></ns:booleanfilter>
   <ns:resultoffset>0</ns:resultoffset>
   <ns:maxresultcount>15</ns:maxresultcount>
  </ns:Find>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
